cases/PR2.2/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\      /   O peration   |                                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

solver          shockFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;

endTime         0.01000000;
deltaT          1e-6;

writeControl    timeStep;
writeInterval   1;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;
adjustTimeStep   yes;
maxCo           0.2;
maxDeltaT       1e-4;

functions
{
    #include "functions"
}
