cases/PR2.2/system/mapFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\      /   O   peration   |                                                 |
|   \\  /    A nd         |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      mapFieldsDict;
}
// -----------------------------------------------------------------------------

patchMap
(
    engineInlet engineInlet
    freestreamInlet freestreamInlet
    outlet outlet
    internalNozzleWall nozzleWall
    externalNozzleWall nozzleWall
    topSlip topSlip
    axis axis
    frontAndBack frontAndBack
);

cuttingPatches
(
);

// -----------------------------------------------------------------------------
